{"name":"Oleg Teretenko","headerTaglineOne":"Hi there👋","headerTaglineTwo":"I'm Oleg Teretenko, ","headerTaglineThree":"a product designer","headerTaglineFour":"with 8+ years of experience","showCursor":true,"showBlog":false,"darkMode":true,"showResume":true,"socials":[{"id":"ccd6fb56-d1ef-41e0-8898-dc1c363dd973","title":"Download CV","link":"https://drive.google.com/file/d/1lkHaoJ5hf7lecovCK-s_9ax5dwyWXqiM/view?usp=share_link"},{"id":"55a2dae7-b857-4bfe-9940-7e7d569ffae7","title":"Linkedin","link":"https://www.linkedin.com/in/teretenko/"}],"projects":[{"id":"1","title":"System unavailability messages","description":"\"All systems are currently unavailable\" and \"Scheduled maintenance is in progress\" - these are the types of messages that need to be displayed to customers if something goes wrong. My task was to develop an interface for bank's customer support staff, allowing them to easily configure these and other messages.","imageSrc":"../img/project-1/1-0.png","url":"/project-1","alt":"System unavailability messages - Interface for configuring system messages for bank's customer support staff"},{"id":"2","title":"Security questions","description":"A new feature in the banking app for enhanced financial transaction security","imageSrc":"../img/project-2/2-0.png","url":"/project-2","alt":"Security questions - Design of a new feature for the bank's mobile application"},{"id":"3","title":"Routing control","description":"User Interface for the bank's technical support service","imageSrc":"../img/project-3/3-0.png","url":"/project-3","alt":"Routing control - Interface for configuring and redirecting traffic between data centers (DC) for the bank's technical support service"},{"id":"4","title":"Major delivery app update","description":"Enhancing user experience in the shopping cart and checkout, integrating delivery functionality into the main app","imageSrc":"../img/project-4/4-0.png","url":"/project-4","alt":"Grocery delivery app - Design of a popular application with millions of users"},{"id":"5","title":"Search at the bottom","description":"A fresh solution enhancing user experience","imageSrc":"../img/project-5/5-0.png","url":"/project-5","alt":"Search at the bottom. UI Delivery app"},{"id":"6","title":"Threads logo","description":"When the new social network Threads launched, I thought that many users might want to add its logo to their websites after registering. However, since everyone has websites with different designs, some might need a red or blue logo icon, while others prefer a full-color version. I created this non-commercial project myself using React and Ant Design.","imageSrc":"../img/p-1.png","url":"https://logotap.online"},{"id":"7","title":"AI-Powered English Learning Project","description":"This is a story of how I learned English using ChatGPT, Python, and React. These tools helped me categorize which words I already knew and which ones I should learn. For more details about this project, read the article on medium.com.","imageSrc":"../img/p-2.png","url":"https://bootcamp.uxdesign.cc/from-design-thinking-to-ai-a-product-designers-journey-in-language-learning-31a479d365cc"},{"id":"8","title":"Telegram Reminder Bot","description":"The Telegram Reminder Bot is designed to assist users by sending timely reminders to engage with their favorite apps. The bot is versatile, supporting multiple applications with customizable reminder intervals. Built with a robust tech stack, it ensures seamless operation and user-friendly interaction.","imageSrc":"../img/p-3.png","url":"https://t.me/reminderApps_bot"},{"id":"9","title":"Speedy TON","description":"Speedy TON is a Telegram mini-app that generates unique cryptocurrency transfer links, which can be easily shared in chats or pinned in groups. Integrated with the Telegram Web Apps API, it lets users quickly connect their wallets and send transfers. No database is required—wallet addresses are embedded in the URL. I developed the entire app, from design to release in the Telegram App Center.","imageSrc":"../img/p-4.png","url":"https://t.me/SpeedyPay_bot/speedyton"}],"services":[{"id":"1","title":"Art Direction","description":"We help with the creation and development of online advertising ideas, with particular focus on their visual appearance."},{"id":"2","title":"Branding","description":"We design key brand elements such as the logo, color scheme, typography, and other design components that makes your brand stand out from competitors."},{"id":"3","title":"Web Design","description":"We build and optimize your online presence.  Website is the digital entry point into your business and a powerful revenue channel."},{"id":"4","title":"3D Design","description":"We combine creative design and technical skills to build striking 3D visualisations that bring your project to life."}],"aboutpara":"Hi, my name is Oleg and I am a Product Designer with over 8 years of experience in various fields, including e-commerce, fintech, and edtech. During this time, I've had the opportunity to work in both small agencies and startups, as well as large corporations.\n\nI have a technical background with a Master's in Engineering and Technology. I completed UX/UI design courses by MailGroup and product metrics courses by GoPractice. Additionally, I have strong knowledge of CSS and HTML, which I gained through courses by Yandex. Currently, I'm passionate about React development.\n\nMy hobby is music, and I have over 20 years of experience in music, including a decade in a cover band where I played the accordion, guitar, and keyboards.","resume":{"tagline":"I'm Senior Product Designer with 8+ years of experience","description":"I create user-friendly interface designs for web and mobile applications. I've already helped many companies improve their product and business metrics.","experiences":[{"id":"1","dates":"February 2024 - ...","type":"Senior Product Designer","position":"Dodo pizza","bullets":"I am working on the restyling of a pizza ordering app, developing new features, and improving the user experience."},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"October 2022 - February 2024","type":"Senior Product Designer","position":"Magnit IT","bullets":"As a Product Designer for one of the largest retail companies in Russia, with approximately 27,000 stores in 67 regions, I work on a mobile application used by millions of users for grocery delivery. I solve user problems and improve their user flow within the app to improve product metrics. My achievements include:  \n• Participated in the merger of two applications, resulting in a +20% increase in users who started ordering delivery through the primary app. \n• Developed a unified platform solution for the shopping cart and checkout. Services for ordering groceries, medicines, and cosmetics are integrated into a single application, utilizing a consistent user flow that enhances the overall user experience. \n• Implemented an Estimated Delivery Time (EDT) flow in the delivery app, effectively reducing the burden on the call center. \n• Successfully reduced the order non-fulfillment rate due to address delivery issues and payment errors."},{"id":"8658e4a5-bc10-426a-af1f-a2d01dadb5af","dates":"October 2020 - October 2022","type":"Senior Designer","position":"VTB Bank","bullets":"To ensure stable operation of the bank used by over 15 million users, I designed intuitive interfaces as a product designer. This included interfaces for customer support services, tools for responding to unexpected situations in the bank's systems, and interfaces for configuring internal bank services like diagnostic consoles, a unified administrator console, headless CMS, and a console for redistributing data center routes, among others. I also contributed to developing features for the bank's web and mobile applications, including the development of a digital ruble."},{"id":"8ba8643d-69d0-43ec-b975-9487b00e5d5f","dates":"July 2017 - May 2020","type":"UX Designer","position":"Makerobots","bullets":"I designed an edtech startup's platform for online courses for kids, which included editing lesson content, creating animated videos, and designing a user-friendly interface. To ensure the platform was effective, I analyzed user behavior, tested the product, and created user flows. As a co-founder and manager, I oversaw day-to-day operations, managed the team, and ensured projects were completed within budget and on time, providing me with valuable business insight on collaboration, communication, and goal-setting."},{"id":"ccb26d7b-7eeb-4117-8db8-253adf0d732d","dates":"May 2016 - June 2017","type":"Web Designer","position":"Animate web, web agency","bullets":"I have worked on a variety of projects, including designing landing pages and online stores for businesses in various industries. In addition, I have experience in creating ads and analyzing their performance for e-commerce companies. I have also contributed to the production of promotional videos, using my creativity and design skills to effectively communicate the brand message."},{"id":"b302b3c1-7e39-4d86-b761-f3c2e3747c99","dates":"March 2015 - April 2016","type":"Web Designer","position":"SOK, web agency","bullets":"As a designer, I have extensive experience designing e-commerce pages for websites, including creating visually appealing banners, icons, logos, and item pages that attract and engage customers. Additionally, I have designed shopping carts that are user-friendly and streamlined, optimizing the checkout process for a seamless shopping experience."}],"education":{"universityName":"Siberian Federal University, Master's degree of Engineering and Technology","universityDate":"2004-2010","universityPara":"Additional courses: Yandex, HTML CSS; Mail group, UX/UI designer; GoPractice, Simulator for Learning Data-Driving Product Management and Growth"},"languages":["Collaboration","Communication","Analytical thinking","Self-management","Experience in agile"],"frameworks":["Figma","Adobe","Miro","Jira, Confluence","HTML, CSS"],"others":["Russian, Native","English, Intermediate ","Spanish, Basic"]}}