{"name":"Oleg Teretenko","headerTaglineOne":"Hi there👋","headerTaglineTwo":"I'm Oleg Teretenko, ","headerTaglineThree":"a product designer.","headerTaglineFour":"This is a small selection of my past projects","showCursor":true,"showBlog":false,"darkMode":true,"showResume":true,"socials":[{"id":"ccd6fb56-d1ef-41e0-8898-dc1c363dd973","title":"Download CV","link":"https://drive.google.com/file/d/1obTbttCaIBrSQTZQUBZTdR27Z-0PYRkZ/view?usp=sharing"},{"id":"55a2dae7-b857-4bfe-9940-7e7d569ffae7","title":"Linkedin","link":"https://www.linkedin.com/in/teretenko/"},{"id":"a8684891-4ea2-49a4-b2bf-06bbaf657222","title":"Behance","link":"https://www.behance.net/teretenko"},{"id":"98cfa4af-880e-48ba-a38f-baa2b5525e72","title":"Facebook","link":"https://www.facebook.com/oleg.teretenko"}],"projects":[{"id":"1","title":"Eneo","description":"The design of an e-commerce website in neomorphic style. The presentation includes a menu with navigation through the catalog, a detailed product card, properties of the product, and reviews.","imageSrc":"../img/project-1/1-0.jpg","url":"/project-1","alt":"Eneo - Design of an e-commerce website in neomorphic style"},{"id":"2","title":"Animate web","description":"The mobile version of the website was created for a web agency. A new design with animations was developed, with a strong emphasis on the user flow.","imageSrc":"../img/project-2/2-0.jpg","url":"/project-2","alt":"Animate web - Mobile version of the website for a web agency"},{"id":"3","title":"Alarm clock","description":"A mobile application for the hearing-impaired that serves as an alarm clock. The main features include connecting to devices such as smartwatches and fitness trackers, as well as vibration and light signals in three modes.","imageSrc":"../img/project-3/3-0.jpg","url":"/project-3","alt":"Alarm clock - Mobile application for the hearing-impaired serving as an alarm clock"},{"id":"4","title":"System unavailability messages","description":"\"All systems are currently unavailable\" and \"Scheduled maintenance is in progress\" - these are the types of messages that need to be displayed to customers if something goes wrong. My task was to develop an interface for bank's customer support staff, allowing them to easily configure these and other messages.","imageSrc":"../img/project-4/4-0.jpg","url":"/project-4","alt":"System unavailability messages - Interface for configuring system messages for bank's customer support staff"},{"id":"5","title":"Security questions","description":"A new feature design had to be developed for the bank's mobile application. Control questions are an additional way of identifying the client. In the app settings, the user should understand the purpose of control questions, select a question and provide an answer.","imageSrc":"../img/project-5/5-0.jpg","url":"/project-5","alt":"Security questions - Design of a new feature for the bank's mobile application"},{"id":"6","title":"Routing control","description":"The main task of the project is to create an interface for the bank's technical support service, which is responsible for installing new application releases and troubleshooting. To configure and redirect traffic between data centers (DC), you need to access the code using different applications. It's tedious and inconvenient. The new UI can switch traffic between DC's when we have an accident with one of them (when one of the DC's is offline), when we want to start beta testing, or when we want to do a smooth rollout of the new release.","imageSrc":"../img/project-6/6-0.jpg","url":"/project-6","alt":"Routing control - Interface for configuring and redirecting traffic between data centers (DC) for the bank's technical support service"},{"id":"7","title":"Grocery delivery app","description":"Major app update for millions of users","imageSrc":"../img/project-7/7-0.jpg","url":"/project-7","alt":"Grocery delivery app - Design of a popular application with millions of users"}],"services":[{"id":"1","title":"Art Direction","description":"We help with the creation and development of online advertising ideas, with particular focus on their visual appearance."},{"id":"2","title":"Branding","description":"We design key brand elements such as the logo, color scheme, typography, and other design components that makes your brand stand out from competitors."},{"id":"3","title":"Web Design","description":"We build and optimize your online presence.  Website is the digital entry point into your business and a powerful revenue channel."},{"id":"4","title":"3D Design","description":"We combine creative design and technical skills to build striking 3D visualisations that bring your project to life."}],"aboutpara":"Hi, my name is Oleg Teretenko and I am a Product Designer. I have been passionate about design since 2015 and obtained my Master's degree in Engineering and Technology from Krasnoyarsk, Russia. (However, I am currently not residing in Russia.) I also have certificates in Mail Group UX/UI design, Yandex HTML & CSS, GoPractice Product metrics.\n\nCurrently, I am working as a Product Designer for a major retail company, where I focus on a mobile application used by millions of users for grocery delivery. In my role, I prioritize user needs by analyzing product metrics and user feedback to enhance the app's user flow and overall experience. I like generate new ideas and concepts to continuously improve user experience.\n\nMy work experience includes designing interfaces for banking products used by 15 million users in fintech, including customer support and configuring bank services. I also have extensive experience in designing for edtech.\n\nWhen I'm not working, I enjoy playing and listening to music, watching movies and series, and exploring new places. I'm always interested in connecting with like-minded individuals and collaborating on exciting projects.","resume":{"tagline":"I'm Senior Product Designer with 8+ years experience","description":"I design intuitive mobile and web interfaces. Recently, I designed a grocery delivery app used by millions at a major Russian retailer. My process includes analyzing metrics, testing hypotheses, preparing research layouts, and conducting user interviews to improve user experience. I have previously designed interfaces for banking products used by 15 million users in fintech, including customer support and configuring bank services. I also have extensive experience designing for edtech. My work process prioritizes user needs and includes empathizing, defining needs, ideating, prototyping, and testing.","experiences":[{"id":"1","dates":"October 2022 - Present","type":"Senior Product Designer","position":"Magnit IT","bullets":"As a Product Designer for one of the largest retail companies in Russia, with approximately 27,000 stores in 67 regions, I work on a mobile application used by millions of users for grocery delivery. I solve user problems and improve their user flow within the app to improve product metrics. I analyze metrics using App metrica and Datalens, test hypotheses, prepare layouts for quantitative and qualitative research, and participate in user interviews. Additionally, I develop new components for the design system, including using design tokens, and bring new ideas and concepts to improve the user experience."},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"October 2020 - October 2022","type":"Senior Designer","position":"VTB Bank","bullets":"To ensure stable operation of the bank used by over 15 million users, I designed intuitive interfaces as a product designer. This included interfaces for customer support services, tools for responding to unexpected situations in the bank's systems, and interfaces for configuring internal bank services like diagnostic consoles, a unified administrator console, headless CMS, and a console for redistributing data center routes, among others. I also contributed to developing features for the bank's web and mobile applications, including the development of a digital ruble."},{"id":"8658e4a5-bc10-426a-af1f-a2d01dadb5af","dates":"February 2019 - June 2020","type":"Senior Web Designer","position":"Animate web, web agency","bullets":"I have worked on a variety of projects, including designing landing pages and online stores for businesses in various industries. In addition, I have experience in creating ads and analyzing their performance for e-commerce companies. I have also contributed to the production of promotional videos, using my creativity and design skills to effectively communicate the brand message."},{"id":"8ba8643d-69d0-43ec-b975-9487b00e5d5f","dates":"April 2014 - May 2020","type":"UX Designer","position":"Makerobots","bullets":"I designed an edtech startup's platform for online courses for kids, which included editing lesson content, creating animated videos, and designing a user-friendly interface. To ensure the platform was effective, I analyzed user behavior, tested the product, and created user flows. As a co-founder and manager, I oversaw day-to-day operations, managed the team, and ensured projects were completed within budget and on time, providing me with valuable business insight on collaboration, communication, and goal-setting."},{"id":"ccb26d7b-7eeb-4117-8db8-253adf0d732d","dates":"March 2017 - April 2018","type":"Web Designer","position":"SOK, web agency","bullets":"As a designer, I have extensive experience designing e-commerce pages for websites, including creating visually appealing banners, icons, logos, and item pages that attract and engage customers. Additionally, I have designed shopping carts that are user-friendly and streamlined, optimizing the checkout process for a seamless shopping experience."}],"education":{"universityName":"Siberian Federal University, Master's degree of Engineering and Technology","universityDate":"2004-2010","universityPara":"Additional courses: Yandex, HTML CSS; Mail group, UX/UI designer; GoPractice, Simulator for Learning Data-Driving Product Management and Growth"},"languages":["Collaboration","Communication","Analytical thinking","Self-management","Experience in agile"],"frameworks":["Figma","Adobe","Miro","Jira, Confluence","HTML, CSS"],"others":["Russian, Native","English, Intermediate ","Spanish, Basic"]}}